require 'yaml'
require_relative 'import_articles'

keywords = [
	/\bизмен.{0,6}|обнов.{0,6}\b/,
	/\bввест.{0,4}|введен.{0,4}\b/,
	/\bобсу(д|жд).*\b/,
	/\bсмогут\b/,
	/\bпридется\b/,
	/\bпланир.{0,4}\b/,
	/\bнамере.{0,4}\b/,
	/\bпредлаг.{0,4}|предлож.{0,6}\b/,
	/\bотмен.{0,6}\b/,
	/\bпереход.{0,6}\b/,
	/\bиде.{0,4}|инициатив.{0,4}\b/,
	/\bплат.{0,6}\b/,
	/\bуплат.{0,4}\b/,



	/\bминфин.{0,3}|министерств.{0,4}\ финансов\b/,
	/\bминэк.{0,4}|министерств.{0,4}\ экономического|минэконом.{0,10}\b/,
	/\bминстро.{0,4}|министерств.{0,4}\ строительства\b/,
	/\bфнс|ифнс|федеральн.{0,4}\ налог.{0,4}\ служб.{0,4}\b/,
	/\bгд|госдум.{0,4}|государственн.{0,4}\ дум.{0,4}\b/,



	/\bналог.{0,12}\b/,
	/\bсбор.{0,4}\b/,
	/\bпен.{0,4}\b/,
	/\bстрахов.{0,4}\ взнос.{0,4}\b/,
	/\bльгот.{0,4}\b/,
	/\bвыплат.{0,4}\b/,
	/\bфз|федеральн.{0,4}\ закон.{0,4}\b/,
	/\bзакон.{0,4}\b/,
	/\bзаконопроект.{0,4}\b/,
	/\bкодекс.{0,4}\b/,
	/\bнк|налого.{0,4}\ кодекс.{0,4}\b/,
	/\bндс|налог.{0,4}\ на\ добавленн.{0,4}\b/,
	/\b.{0,3}ндфл.{0,4}\b/,
	/\bзарплат.{0,4}|заработн.{0,4}\ плат.{0,4}\b/,
	/\bфизлиц.*|физ*.\ лиц.*\b/,
	/\bставк.{0,4}\b/,
	/\bпоправ.{0,4}|правк.{0,4}\b/,
	/\bпроект.{0,4}\b/,
	/\bиндекс.{0,4}\b/,
	/\bкадастр.{0,4}\b/,
	/\bзастройщик.{0,4}\b/,
	/\bпроектн.{0,4}\ финансиров.{0,6}\b/,
	/\bэскроу.*\b/,



	/\bкитай\b/,
	/\bвалют.{0,6}\b/,
	/\bсша|америк.*|соединенн.{1,3}\ штат.{1,3}\ америк.{1,3}\b/

]

keywords_probs = Hash.new

keywords.each do |keyword|
  keywords_probs[keyword] = [ [],[] ]
end

[:ham, :spam].each_with_index do |category, index|
  keywords.each do |keyword|
    counter = 0
      ARTICLES[category].each do |article|
        counter += 1 if article.match?(keyword)
      end
    keywords_probs[keyword][index] << (counter/(ARTICLES[category].length.to_f)).round(5)
    end
end

File.open('../yaml data/keywords_probs.yaml', 'w') do |file|
  file.truncate(0)
  file.write(keywords_probs.to_yaml)
end

